<!-- tf-plan:infra/home_page -->
### Terraform plan for `infra/home_page`

```
data.terraform_remote_state.bootstrap: Reading...
aws_acm_certificate.site: Refreshing state... [id=arn:aws:acm:us-east-1:135237610569:certificate/43fcb474-2795-4fa8-b464-5f5b7f7fd96a]
aws_cloudfront_origin_access_control.site: Refreshing state... [id=E1S6MZ8XNRZ7J7]
data.aws_cloudfront_cache_policy.caching_optimized: Reading...
data.aws_caller_identity.current: Reading...
aws_route53_zone.primary: Refreshing state... [id=Z00219133F0M2CT8JESD4]
aws_s3_bucket.site: Refreshing state... [id=ilyaraz-org-static-site]
data.aws_caller_identity.current: Read complete after 0s [id=135237610569]
data.aws_cloudfront_cache_policy.caching_optimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
data.terraform_remote_state.bootstrap: Read complete after 1s
data.aws_iam_openid_connect_provider.github: Reading...
data.aws_iam_openid_connect_provider.github: Read complete after 0s [id=arn:aws:iam::135237610569:oidc-provider/token.actions.githubusercontent.com]
data.aws_iam_policy_document.github_assume_role: Reading...
data.aws_iam_policy_document.github_assume_role: Read complete after 0s [id=2069265665]
aws_route53_record.cert_validation["www.ilyaraz.org"]: Refreshing state... [id=Z00219133F0M2CT8JESD4__3c5e3e1080b0dac164cd553e4703d9ce.www.ilyaraz.org._CNAME]
aws_s3_bucket_public_access_block.site: Refreshing state... [id=ilyaraz-org-static-site]
aws_s3_bucket_ownership_controls.site: Refreshing state... [id=ilyaraz-org-static-site]
aws_s3_bucket_server_side_encryption_configuration.site: Refreshing state... [id=ilyaraz-org-static-site]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.github_deploy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github_deploy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketLocation",
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::ilyaraz-org-static-site",
            ]
        }
      + statement {
          + actions   = [
              + "s3:AbortMultipartUpload",
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucketMultipartUploads",
              + "s3:ListMultipartUploadParts",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::ilyaraz-org-static-site/*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudfront:CreateInvalidation",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.site_bucket will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "site_bucket" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::ilyaraz-org-static-site/*",
            ]
          + sid       = "AllowCloudFrontServicePrincipalRead"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::ilyaraz-org-static-site",
              + "arn:aws:s3:::ilyaraz-org-static-site/*",
            ]
          + sid       = "DenyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # aws_acm_certificate_validation.site will be created
  + resource "aws_acm_certificate_validation" "site" {
      + certificate_arn         = "arn:aws:acm:us-east-1:135237610569:certificate/43fcb474-2795-4fa8-b464-5f5b7f7fd96a"
      + id                      = (known after apply)
      + region                  = "us-east-1"
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudfront_distribution.site will be created
  + resource "aws_cloudfront_distribution" "site" {
      + aliases                         = [
          + "ilyaraz.org",
          + "www.ilyaraz.org",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + logging_v1_enabled              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags_all                        = (known after apply)
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cache_policy_id        = "658327ea-f89d-4fab-a63d-7e88639e58f6"
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = true
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "s3-ilyaraz-org-static-site"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + grpc_config (known after apply)
        }

      + origin {
          + connection_attempts         = 3
          + connection_timeout          = 10
          + domain_name                 = "ilyaraz-org-static-site.s3.us-west-2.amazonaws.com"
          + origin_access_control_id    = "E1S6MZ8XNRZ7J7"
          + origin_id                   = "s3-ilyaraz-org-static-site"
          + response_completion_timeout = (known after apply)
            # (1 unchanged attribute hidden)
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:135237610569:certificate/43fcb474-2795-4fa8-b464-5f5b7f7fd96a"
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_iam_role.github_actions will be created
  + resource "aws_iam_role" "github_actions" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                              + "token.actions.githubusercontent.com:sub" = "repo:ilyaraz/home-page:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::135237610569:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github-actions-home-page"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.github_deploy will be created
  + resource "aws_iam_role_policy" "github_deploy" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # aws_route53_record.apex_a will be created
  + resource "aws_route53_record" "apex_a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ilyaraz.org"
      + type            = "A"
      + zone_id         = "Z00219133F0M2CT8JESD4"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.apex_aaaa will be created
  + resource "aws_route53_record" "apex_aaaa" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ilyaraz.org"
      + type            = "AAAA"
      + zone_id         = "Z00219133F0M2CT8JESD4"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.cert_validation["ilyaraz.org"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_1094ecbca03a88f8a60a855d338cfbca.ilyaraz.org"
      + records         = [
          + "_579bec5f65d3b58423682926df77ee52.jkddzztszm.acm-validations.aws.",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z00219133F0M2CT8JESD4"
    }

  # aws_route53_record.cert_validation["www.ilyaraz.org"] will be updated in-place
  ~ resource "aws_route53_record" "cert_validation" {
      + allow_overwrite                  = true
        id                               = "Z00219133F0M2CT8JESD4__3c5e3e1080b0dac164cd553e4703d9ce.www.ilyaraz.org._CNAME"
        name                             = "_3c5e3e1080b0dac164cd553e4703d9ce.www.ilyaraz.org"
        # (8 unchanged attributes hidden)
    }

  # aws_route53_record.www_a will be created
  + resource "aws_route53_record" "www_a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.ilyaraz.org"
      + type            = "A"
      + zone_id         = "Z00219133F0M2CT8JESD4"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.www_aaaa will be created
  + resource "aws_route53_record" "www_aaaa" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "www.ilyaraz.org"
      + type            = "AAAA"
      + zone_id         = "Z00219133F0M2CT8JESD4"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_s3_bucket_policy.site will be created
  + resource "aws_s3_bucket_policy" "site" {
      + bucket = "ilyaraz-org-static-site"
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "us-west-2"
    }

Plan: 10 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + cloudfront_distribution_id = (known after apply)
  + cloudfront_domain_name     = (known after apply)
  + github_actions_role_arn    = (known after apply)
  + github_oidc_provider_arn   = "arn:aws:iam::135237610569:oidc-provider/token.actions.githubusercontent.com"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
